export const data = JSON.parse("{\"key\":\"v-210c8944\",\"path\":\"/essay/2019-new-service-building.html\",\"title\":\"사내 신규 서비스 경험기\",\"lang\":\"en-US\",\"frontmatter\":{\"title\":\"사내 신규 서비스 경험기\"},\"headers\":[{\"level\":2,\"title\":\"들어가며\",\"slug\":\"들어가며\",\"link\":\"#들어가며\",\"children\":[]},{\"level\":2,\"title\":\"글의 순서\",\"slug\":\"글의-순서\",\"link\":\"#글의-순서\",\"children\":[]},{\"level\":2,\"title\":\"꼼꼼하게 요구사항 분석 하기\",\"slug\":\"꼼꼼하게-요구사항-분석-하기\",\"link\":\"#꼼꼼하게-요구사항-분석-하기\",\"children\":[{\"level\":3,\"title\":\"왜 요구사항을 꼼꼼하게 분석해야 할까요\",\"slug\":\"왜-요구사항을-꼼꼼하게-분석해야-할까요\",\"link\":\"#왜-요구사항을-꼼꼼하게-분석해야-할까요\",\"children\":[]},{\"level\":3,\"title\":\"요구사항 분석 방법\",\"slug\":\"요구사항-분석-방법\",\"link\":\"#요구사항-분석-방법\",\"children\":[]}]},{\"level\":2,\"title\":\"구현 전에 구조 설계하기\",\"slug\":\"구현-전에-구조-설계하기\",\"link\":\"#구현-전에-구조-설계하기\",\"children\":[{\"level\":3,\"title\":\"왜 설계를 해야 할까요\",\"slug\":\"왜-설계를-해야-할까요\",\"link\":\"#왜-설계를-해야-할까요\",\"children\":[]},{\"level\":3,\"title\":\"사상과 관심 분리\",\"slug\":\"사상과-관심-분리\",\"link\":\"#사상과-관심-분리\",\"children\":[]}]},{\"level\":2,\"title\":\"코딩룰 정하기\",\"slug\":\"코딩룰-정하기\",\"link\":\"#코딩룰-정하기\",\"children\":[{\"level\":3,\"title\":\"왜 코딩룰을 정해야 할까요\",\"slug\":\"왜-코딩룰을-정해야-할까요\",\"link\":\"#왜-코딩룰을-정해야-할까요\",\"children\":[]},{\"level\":3,\"title\":\"코딩룰 작성 사례\",\"slug\":\"코딩룰-작성-사례\",\"link\":\"#코딩룰-작성-사례\",\"children\":[]}]},{\"level\":2,\"title\":\"의미 있었던 코딩 가이드라인 5가지\",\"slug\":\"의미-있었던-코딩-가이드라인-5가지\",\"link\":\"#의미-있었던-코딩-가이드라인-5가지\",\"children\":[{\"level\":3,\"title\":\"정도(程度) 지키기 위한 가이드라인\",\"slug\":\"정도-程度-지키기-위한-가이드라인\",\"link\":\"#정도-程度-지키기-위한-가이드라인\",\"children\":[]},{\"level\":3,\"title\":\"가이드라인 5가지\",\"slug\":\"가이드라인-5가지\",\"link\":\"#가이드라인-5가지\",\"children\":[]}]},{\"level\":2,\"title\":\"마치며\",\"slug\":\"마치며\",\"link\":\"#마치며\",\"children\":[]}],\"git\":{\"updatedTime\":1687351424000,\"contributors\":[{\"name\":\"ChoDragon9\",\"email\":\"04whdydrn30@gmail.com\",\"commits\":1}]},\"filePathRelative\":\"essay/2019-new-service-building.md\"}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
